In [ ]:
# Adrian Marinovich - Springboard Assignment - Data Wrangling Exercise #2
# R Jupyter notebook with markdown at Azure Notebooks: https://notebooks.azure.com/adriatic/libraries/springboard 
# Version control at GitHub repository: github.com/adriatic13/springboard

In [ ]:
#Getting started
#
#    Read the description of the data set on the Kaggle website.
#
#    Download the data as an excel file here.
#
#Exercise
#
#Using R, you’ll be handling missing values in this data set, and creating a new data set. 
#  Specifically, these are the tasks you need to do:

In [ ]:
#0: Load the data in RStudio
#
#Save the data set as a CSV file called titanic_original.csv and load it in RStudio into a data frame.

In [1]:
titanic_orig <- read.csv('titanic_original.csv')
str(titanic_orig)

'data.frame':	1309 obs. of  15 variables:
 $ X        : int  1 2 3 4 5 6 7 8 9 10 ...
 $ pclass   : int  1 1 1 1 1 1 1 1 1 1 ...
 $ survived : int  1 1 0 0 0 1 1 0 1 0 ...
 $ name     : Factor w/ 1307 levels "Abbing, Mr. Anthony",..: 22 24 25 26 27 31 46 47 51 55 ...
 $ sex      : Factor w/ 2 levels "female","male": 1 2 1 2 1 2 1 2 1 2 ...
 $ age      : num  29 0.917 2 30 25 ...
 $ sibsp    : int  0 1 1 1 1 0 1 0 2 0 ...
 $ parch    : int  0 2 2 2 2 0 0 0 0 0 ...
 $ ticket   : Factor w/ 929 levels "110152","110413",..: 188 50 50 50 50 125 93 16 77 826 ...
 $ fare     : num  211 152 152 152 152 ...
 $ cabin    : Factor w/ 186 levels "A10","A11","A14",..: 44 80 80 80 80 150 146 16 62 NA ...
 $ embarked : Factor w/ 3 levels "C","Q","S": 3 3 3 3 3 3 3 3 3 1 ...
 $ boat     : Factor w/ 27 levels "1","10","11",..: 12 3 NA NA NA 13 2 NA 27 NA ...
 $ body     : int  NA NA NA 135 NA NA NA NA NA 22 ...
 $ home.dest: Factor w/ 369 levels "?Havana, Cuba",..: 309 231 231 231 231 237 162 24 22 229 ...

In [ ]:
# 1: Port of embarkation
#
#The embarked column has some missing values, which are known to correspond to passengers 
#  who actually embarked at Southampton. Find the missing values and replace them with S. 
#  (Caution: Sometimes a missing value might be read into R as a blank or empty string.)

In [48]:
titanic_clean <- titanic_orig
#subset(titanic_clean, is.na(embarked) | embarked==NA | embarked=='NA' | embarked=='', select=c(name, embarked))
#subset(titanic_clean, is.na(embarked), select=c(name, embarked))
#titanic_clean[which(is.na(titanic_clean$embarked)),]
titanic_clean$embarked[is.na(titanic_clean$embarked)] <- 'S'

In [49]:
#confirming replace of NA by S
titanic_clean[which(titanic_clean$ticket=='113572'),]

    X   pclass survived name                                      sex    age
169 169 1      1        Icard, Miss. Amelie                       female 38
285 285 1      1        Stone, Mrs. George Nelson (Martha Evelyn) female 62
    sibsp parch ticket fare cabin embarked boat body home.dest
169 0     0     113572 80   B28   S        6    NA   NA
285 0     0     113572 80   B28   S        6    NA   Cincinatti, OH

In [ ]:
#2: Age
#
#You’ll notice that a lot of the values in the Age column are missing. 
#  While there are many ways to fill these missing values, using the mean 
#  or median of the rest of the values is quite common in such cases.
#
#    1. Calculate the mean of the Age column and use that value to populate the missing values
#
#    2. Think about other ways you could have populated the missing values in the age column. 
#      Why would you pick any of those over the mean (or not)?

In [30]:
#titanic_clean[which(is.na(titanic_clean$age)),]

In [50]:
mean(titanic_clean$age, na.rm=TRUE)
titanic_clean$age[is.na(titanic_clean$age)] <- mean(titanic_clean$age, na.rm=TRUE)

#Other ways: 
#  1. Break the passengers with missing age into adult and child groups, and infer 
#  whether someone is adult or child based on a non-zero value for parch in combination 
#  with passenger by same last name whose age is present and shows an adult/child age 
#  to imply the relation
#  2. Use the median instead of age - I think I would prefer this, since age extremes
#  would have less of an impact by using median and might therefore more accurately
#  approach the missing ages

[1] 29.88113

In [ ]:
#3: Lifeboat
#
#You’re interested in looking at the distribution of passengers in different lifeboats, 
# but as we know, many passengers did not make it to a boat :-( 
# This means that there are a lot of missing values in the boat column. 
# Fill these empty slots with a dummy value e.g. the string 'None' or 'NA'

In [51]:
#str(titanic_clean)
titanic_clean$boat <- as.character(titanic_clean$boat)
titanic_clean$boat[is.na(titanic_clean$boat)] <- 'None'

In [ ]:
#4: Cabin
#
#You notice that many passengers don’t have a cabin number associated with them.
#
#    Does it make sense to fill missing cabin numbers with a value?
#
#    What does a missing value here mean?
#
#You have a hunch that the fact that the cabin number is missing might be a useful 
#  indicator of survival. Create a new column has_cabin_number which has 1 if there 
#  is a cabin number, and 0 otherwise.

In [ ]:
# It does not make sense to fill cabin numbers with a value, since a missing value
#  may mean that the passenger was not assigned to a cabin, chose not to have the
#  cabin number noted, and/or the passenger may be sharing a cabin with another passenger, 
#  so that there is no meaningful way to impute a value for a missing value

In [52]:
titanic_clean$has_cabin_number[!is.na(titanic_clean$cabin)] <- 1
titanic_clean$has_cabin_number[is.na(titanic_clean$cabin)] <- 0

In [ ]:
#5: Submit the project on Github
#
#Include your code, the original data as a CSV file titanic_original.csv, 
#  and the cleaned up data as a CSV file called titanic_clean.csv.

In [56]:
write.csv(titanic_clean, file='titanic_clean.csv')

In [57]:
list.files()

[1] "Marinovich_Data_Wrangling_Ex1.ipynb" "Marinovich_Data_Wrangling_Ex2.ipynb"
[3] "README.md"                           "refine_clean.csv"
[5] "refine_original.csv"                 "refine.xlsx"
[7] "titanic_clean.csv"                   "titanic3.xls"